class Map:

    def __init__(self, name_level, data_level):
        self._name_level = name_level
        self._data_level = data_level

    @property
    def name_level(self):
        return self._name_level

    @property
    def data_level(self):
        return self._data_level

class AddMap:
    def __init__(self):

        self.level = []

        self.level.append(Map("Квадрат", [[1, 1, 1],
                                          [1, 0, 1],
                                          [1, 1, 1]]))

        self.level.append(Map("Цветок", [[0, 1, 1, 1, 0],
                                       [1, 1, 0, 1, 1],
                                       [1, 0, 0, 0, 1],
                                       [1, 1, 0, 1, 1],
                                       [0, 1, 1, 1, 0]]))

        self.level.append(Map("Дерево", [[1, 1, 1],
                                 [1, 1, 1],
                                 [1, 1, 1],
                                 [0, 1, 0],
                                 [0, 1, 0]]))

        self.level.append(Map("Гриб", [[0, 0, 1, 0, 0],
                                     [0, 1, 1, 1, 0],
                                     [1, 1, 1, 1, 1],
                                     [0, 0, 1, 0, 0],
                                     [0, 0, 1, 0, 0]]))

        self.level.append(Map("Медведь", [[0, 1, 0, 1, 0],
                                 [0, 0, 1, 0, 0],
                                 [1, 1, 0, 1, 1],
                                 [0, 1, 1, 1, 0],
                                 [0, 1, 0, 1, 0]]))

        self.level.append(Map("Сердце", [[0, 1, 0, 1, 0],
                                     [1, 1, 1, 1, 1],
                                     [1, 1, 1, 1, 1],
                                     [0, 1, 1, 1, 0],
                                     [0, 0, 1, 0, 0]]))

        self.level.append(Map("Смайлик", [[1, 1, 0, 1, 1],
                                     [0, 0, 0, 0, 0],
                                     [0, 1, 1, 1, 0],
                                     [0, 0, 1, 0, 0]]))

        self.level.append(Map("Флаг", [[1, 1, 1, 1, 1, 1, 1, 1],
                                     [1, 1, 1, 1, 1, 1, 1, 1],
                                     [1, 1, 1, 1, 1, 1, 1, 1],
                                     [1, 1, 1, 1, 1, 1, 1, 1],
                                     [1, 1, 1, 1, 1, 1, 1, 1],
                                     [1, 0, 0, 0, 0, 0, 0, 0],
                                     [1, 0, 0, 0, 0, 0, 0, 0],
                                     [1, 0, 0, 0, 0, 0, 0, 0],
                                     [1, 0, 0, 0, 0, 0, 0, 0],
                                     [1, 0, 0, 0, 0, 0, 0, 0]]))

        self.level.append(Map("Мобильник", [[1, 1, 1],
                                     [1, 1, 1],
                                     [0, 1, 1],
                                     [0, 1, 1],
                                     [0, 1, 1],
                                     [0, 1, 1],
                                     [0, 1, 1],
                                     [1, 1, 1],
                                     [1, 1, 1]]))

        self.level.append(Map("Бабочка", [[1, 1, 1, 0, 0, 0, 1, 1, 1],
                                     [1, 1, 1, 1, 0, 1, 1, 1, 1],
                                     [1, 1, 1, 1, 0, 1, 1, 1, 1],
                                     [1, 1, 1, 1, 1, 1, 1, 1, 1],
                                     [0, 0, 1, 1, 1, 1, 1, 0, 0],
                                     [0, 1, 1, 1, 1, 1, 1, 1, 0],
                                     [0, 1, 1, 1, 1, 1, 1, 1, 0]]))
